# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр
print('Введите любое вещественное число и нажмите "Enter": ')
a = float(input())
print ('{} {}'.format(a))
