# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
a = 6
b = 7
c = int(input('Ввведите число и нажмите клавишу "Enter": '))
if c == a:
    print(f'Число {c} соответствует номеру выходного дня')
elif c == b:
    print(f'Число {c} соответствует номеру выходного дня')
else:
    print(f'Число {c} не соответствует номеру выходного дня')
